using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using FDK;

namespace TJAPlayer3
{
    internal class CLang_en : ILang
    {
        string ILang.GetString(int idx)
        {
            if (!dictionnary.ContainsKey(idx))
                return "[!] Index not found in dictionary";

            return dictionnary[idx];
        }


        private static readonly Dictionary<int, string> dictionnary = new Dictionary<int, string>
        {
            [0] = "改变游戏和菜单中\n显示的语言",
            [1] = "系统语言",
            [2] = "<< 返回至菜单",
            [3] = "返回至左侧菜单",
            [4] = "重新载入曲目",
            [5] = "重新载入曲目文件夹",
            [6] = "玩家数量",
            [7] = "选择是否启用双人模式",
            [8] = "完美（かんぺき）模式",
            [9] = "选择多少个不可\n会导致曲目失败\n设为0以禁用",
            [10] = "曲目播放速度",
            [11] = "调整曲目播放速度\n当时间拉伸模式开启时\n曲目播放速度低于0.9x\n可能会导致问题\n注：本选项会影响曲目音高",
            [12] = "AI等级",
            [13] = "决定AI的精确度\n0：AI关闭\n1+：2P会变为AI\n本选项会在开启玩家2自动演奏时禁用"
            [14] = "全局偏移量",
            [15] = "改变所有谱面\n解析出的偏移量\n范围：-99~99ms\n设为负值以减少输入延迟\n重新载入曲目\n以使本选项生效"
            [16] = "布局模式",
            [17] = "可改变选择曲目界面\n的布局模式\n" +
                "0：常规（自上至下斜向）\n" +
                "1：纵向\n" +
                "2：自下至上斜向\n" +
                "3：右向半圆\n" +
                "4：左向半圆",
            [18] = "本选项作用不明\n会导致CPU占用增加且在\n曲目播放速度低于0.9x时\n可能会导致问题",
            [19] = "在全屏和窗口模式间切换",
            [20] = "这是个从DTXMania\n移植的冗余设置\n没有任何作用",
            [21] = "切换随机选取时\n是否采用子文件夹",
            [22] = "开关垂直同步\n打开后帧率将保持在60Hz,\n会使音符滚动更加顺畅\n但会增加输入延迟；\n关闭后不会限制帧率\n会使输入延迟降低\n但会使音符滚动更加不稳定",
            [23] = "开关背景视频\n若本选项开启但文件夹中没有视频\n背景将会变为全黑",
            [24] = "开关背景动画",
            [25] = "曲目预览前的等待时间\n降低该值或将导致\n预览在滚动时就开始播放\n范围：0~10000ms",
            [26] = "这是个从DTXMania\n移植的冗余设置\n没有任何作用",
            [27] = "开关调试模式\n开启会导致右下角\n显示额外信息\n你的延迟校准信息\n将会在hitsoundless模式下显示",
            [28] = "本选项控制背景视频的不透明度\n背景视频不可见时可调高本选项\n\n0：完全透明,\n255：完全不透明",
            [29] = "开关音乐",
            [30] = "开关score.ini文件是否在曲目文件夹中自动存储\n曲目偏移量保存在该文件中\n所以敲击音效关闭时请打开本选项",
            [31] = "这是个本用于BSGain声音设置的冗余选项\n鉴于BSGain支持不可用\n本选项没有任何作用",
            [32] = "这是个本用于正常化\nBSGain音量的冗余选项\n鉴于BSGain支持不可用\n本选项没有任何作用",
            [33] = "这是个开关是否采用曲目音量（SONGVOL）\n的半冗余选项\n0~100之间的值会降低音量\n超过100的值没有任何作用",
            [34] = "调整咚和咔的音量\n若想关闭敲击音效，请将本选项设为0\n退出设置后重启游戏\n以保存本选项",
            [35] = "调整咚酱的语音音量\n退出设置后重启游戏\n以保存本选项",
            [36] = "调整曲目音量\n退出设置后重启游戏\n以保存本选项",
            [37] = "按[降低音量\n按]提高音量\n本选项控制每次的变化幅度\n范围：1~20",
            [38] = "游戏开始前的等待时间\n降低该值或将导致曲目过早开始播放",
            [39] = "开关自动保存结果自动截屏\n只有当获得新高分时才会截屏\n但最高分并不一定是最佳演奏",
            [40] = "开关是否在Discord上共享曲目信息",
            [41] = "当本选项开启时没有输入会被丢弃\n但输入采样率将会降低；\n当本选项关闭时部分输入可能会被丢弃\n但输入采样会更频繁",
            [42] = "开关游戏关闭时\n是否生成TJAPlayer3.log文件\n该文件追踪游戏的性能\n并记录报错信息",
            [43] = "ASIO：\n- 只在支持asio的音频设备上工作\n- 输入延迟最低\n\nWasapi:\n- 关闭除本游戏外的所有音频输出\n- 输入延迟次低\n\nDirect Sound:\n- 允许外部音频输出\n- 输入延迟最高\n注：退出设置以使本选项生效",
            [44] = "改变wasapi模式的缓冲区大小\n在不出现如曲目冻结、时间错误\n的声音问题时\n越小越好\n建议设为0以使用自动估计值\n或通过不断尝试进行调整\n注：退出设置以使本选项生效",
            [45] = "选择asio模式下使用的设备\n注：退出设置以使本选项生效"
            [46] = "开启会使音符滚动更加顺畅\n但或将导致声音延迟\n关闭使音符滚动更加不稳定\n但会确保无声音延迟\n\n关闭时DTXMania会使用其原本的计时器\n反之不然\n\n本选项只在启用WASAPI或ASIO时生效",
            [47] = "显示角色图片",
            [48] = "显示舞者图片",
            [49] = "显示暴徒图片",
            [50] = "显示跑者图片",
            [51] = "显示页脚图片",
            [52] = "切换是否在加载曲目时就开始渲染图片",
            [53] = "显示小角色图片",
            [54] = "从System文件夹中选择皮肤",
            [55] = "设置系统按键的二级菜单",
            [56] = "玩家1自动演奏",
            [57] = "开关玩家1自动演奏\n在选曲界面按F3可快捷开关",
            [58] = "玩家2自动演奏",
            [59] = "开关玩家1自动演奏\n在选曲界面按F4可快捷开关",
            [60] = "滚奏速度",
            [61] = "当开启自动滚奏时\n自动滚奏将每秒敲击本数值次\n不对气球生效\n最快每帧一次\n设为0以关闭",
            [62] = "滚动速度",
            [63] = "改变音符滚动速度\n" +
                "范围：0.1~200x" +
                "（0.5表示半速滚动）",
            [64] = "完美（かんぺき）模式",
            [65] = "选择多少个不可\n会导致曲目失败\n设为0以禁用",
            [66] = "音符修改",
            [67] = "音符将会随机出现\n\n- 部分：每小节内随机交换lane\n- 超级：随机交换chip\n- 超高级随机交换\n（lane数量也会改变）",
            [68] = "隐藏音符",
            [69] = "DORON：隐藏音符\n潜行：隐藏音符和下方文字",
            [70] = "无信息模式",
            [71] = "开关曲目信息显示\n打开将关闭曲目信息显示\n关闭将打开曲目信息显示",
            [72] = "正义模式",
            [73] = "开启会将所有可变为不可",
            [74] = "锁定音符模式",
            [75] = "切换是否将敲击空白处判断为不可",
            [76] = "最小连打显示",
            [77] = "选择开始显示连打的数量\n范围：1~99999",
            [78] = "判定圆圈调整",
            [79] = "升高本值会将判定区域右移\n降低本值会将判定区域左移\n范围：-99~99ms\n设为负值以降低输入延迟"
            [80] = "默认难度",
            [81] = "选择选曲时的默认难度\n里魔王在本选项不为它时不会显示\n除非在表魔王上按右方向键",
            [82] = "记分模式",
            [83] = "选择计分公式\n" +
                    "A类型：第一代\n" +
                    "B类型：第二代\n" +
                    "C类型：第三代\n",
            [84] = "使所有音符权重相同\n使用第四代公式",
            [85] = "谱面分歧提示",
            [86] = "切换是否显示谱面分歧的数值提示\n自动演奏模式下不会显示",
            [87] = "谱面分歧动画",
            [88] = "改变谱面分歧时的动画效果\n" +
                    "A类型：第二代\n" +
                    "B类型：第三代"
            [89] = "幸存者模式",
            [90] = "本模式不可用\n本模式实现了一个类似stepmania的计时器系统\n但部分代码缺失导致功能受限",
            [91] = "大音符判断",
            [92] = "切换双击大音符时是否获得奖励\n开启时单击大音符会导致\n音符消失前出现一个视觉延迟\n双击将获得双倍分数\n关闭时单击与普通音符效果一致\n并将总是获得双倍分数\n尝试双击或将导致\n下个音符被敲击",
            [93] = "开关分数显示",
            [94] = "在左下方显示良/可/不可数量\n（仅在单人模式生效）",
            [95] = "游戏按键设置",
            [96] = "设置游戏按键的二级菜单",
            [97] = "截屏",
            [98] = "截屏键分配：\n分配截屏按键\n（仅可使用键盘\n不可使用手柄）",
            [99] = "左红",
            [10000] = "太鼓按键分配：\n分配左红按键",
            [10001] = "右红",
            [10002] = "太鼓按键分配：\n分配右红按键",
            [10003] = "左蓝",
            [10004] = "太鼓按键分配：\n分配左蓝按键",
            [10005] = "右蓝",
            [10006] = "太鼓按键分配：\n分配右蓝按键",
            [10007] = "左红（玩家2）",
            [10008] = "太鼓按键分配：\n分配玩家2左红按键",
            [10009] = "右红（玩家2）",
            [10010] = "太鼓按键分配：\n分配玩家2右红按键",
            [10011] = "左蓝（玩家2）",
            [10012] = "太鼓按键分配：\n分配玩家2左蓝按键",
            [10013] = "右蓝（玩家2）",
            [10014] = "太鼓按键分配：\n分配玩家2右蓝按键",
            [10018] = "时间拉伸模式",
            [10019] = "全屏模式",
            [10020] = "游戏结束模式",
            [10021] = "随机选取时采用子文件夹",
            [10022] = "垂直同步",
            [10023] = "开关视频播放",
            [10024] = "绘制背景动画",
            [10025] = "曲目预览缓冲",
            [10026] = "图片预览缓冲",
            [10027] = "调试模式",
            [10028] = "背景不透明度",
            [10029] = "开关曲目播放",
            [10030] = "保存得分",
            [10031] = "应用LOUDNESS元信息",
            [10032] = "目标响度",
            [10033] = "应用SONGVOL元信息",
            [10034] = "音效音量",
            [10035] = "语音音量",
            [10036] = "曲目播放音量",
            [10037] = "键盘音量改变幅度",
            [10038] = "曲目播放缓冲",
            [10039] = "自动截屏",
            [10040] = "Discord Rich Presence",
            [10041] = "输入缓冲模式",
            [10042] = "创建报错记录",
            [10043] = "声音播放模式",
            [10044] = "Wasapi缓冲区大小",
            [10045] = "Asio播放设备",
            [10046] = "操作系统计时器模式",
            [10047] = "显示角色",
            [10048] = "显示舞者",
            [10049] = "显示暴徒",
            [10050] = "显示跑者",
            [10051] = "显示页脚",
            [10052] = "快速渲染",
            [10053] = "绘制小角色",
            [10054] = "当前皮肤",
            [10055] = "系统按键设置",
            [10056] = "隐藏段/塔",
            [10057] = "在太鼓模式菜单中、n隐藏段/塔谱面\n" +
                    "注：重新载入曲目\n" +
                "     以使本设置生效",
            [10058] = "曲目预览音量",
            [10059] = "调整曲目预览音量\n退出设置后重启游戏\n以保存本选项",
            [10084] = "真打模式",

            [100] = "太鼓模式",
            [101] = "段位模式",
            [102] = "太鼓宝塔",
            [103] = "商店",
            [104] = "T太鼓冒险",
            [105] = "我的房间",
            [106] = "设置",
            [107] = "退出",

            [150] = "以您自己的节奏演奏曲目！",
            [151] = "按照挑战测试\n连续演奏多个谱面\n并通过评级",
            [152] = "在限定条命内\n演奏长谱面\n并到达塔顶！",
            [153] = "使用游戏中获得的奖牌\n购买曲目和角色！",
            [154] = "克服各种障碍来获得新内容！",
            [155] = "改变名牌信息或角色外观！",
            [156] = "改变游戏风格或总体设置！",
            [157] = "退出游戏\n下次再见！",

            [200] = "返回",
            [201] = "最近演奏曲目",
            [202] = "演奏最近演奏的曲目！",
            [203] = "随机曲目",

            [1000] = "到达楼层",
            [1001] = "失败",
            [1002] = "过关",
            [1003] = "分数",

            [1010] = "魂条",
            [1011] = "良计数",
            [1012] = "可计数",
            [1013] = "不可计数",
            [1014] = "分数",
            [1015] = "滚奏计数",
            [1016] = "击打计数",
            [1017] = "连击",
            [1018] = "准确率",

            [1030] = "返回",
            [1031] = "小角色",
            [1032] = "角色",
            [1033] = "段位头衔",
            [1034] = "名牌头衔",

            [90000] = "【错误】未达成条件！",
            [90001] = "物品仅在商店可用",
            [90002] = "金币价格：",
            [90003] = "购买成功！",
            [90004] = "金币不足！",
            [90005] = "以下条件：",
        };
    }
}
