using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace TJAPlayer3
{
    internal class CLang_jp : ILang
    {
        string ILang.GetString(int idx)
        {
            if (!dictionnary.ContainsKey(idx))
                return "[!] 辞書の指数を見つけられませんでした";

            return dictionnary[idx];
        }


        private static readonly Dictionary<int, string> dictionnary = new Dictionary<int, string>
        {
            [0] = "プレイ中やメニューの\n言語を変更。",
            [1] = "システム言語",
            [2] = "<< 戻る",
            [3] = "左側のメニューに戻ります。",
            [4] = "曲データ再読み込み",
            [5] = "曲データの一覧情報を取得し直します。",
            [6] = "プレイ人数",
            [7] = "プレイ人数切り替え：\n2にすると演奏画面が2人プレイ専用のレイアウトになり、\n2P専用譜面を読み込むようになります。",
            [8] = "Risky",
            [9] = "Riskyモードの設定:\n1以上の値にすると、その回数分の\n可/不可でFAILEDとなります。\n0にすると無効になり、\nDamageLevelに従ったゲージ増減と\nなります。\nStageFailedの設定と併用できます。",
            [10] = "再生速度",
            [11] = "曲の演奏速度を、速くしたり遅くした\n" +
                "りすることができます。\n" +
                "（※一部のサウンドカードでは正しく\n" +
                "　再生できない可能性があります。）\n" +
                "\n" +
                "TimeStretchがONのときに、演奏\n" +
                "速度をx0.850以下にすると、音の\n" +
                "ズレが大きくなります。",
            [16] = "選曲画面レイアウト",
            [17] = "選曲画面のレイアウトの変更ができます。\n" +
                "０＝＞通常の設計（上下斜）\n" +
                "１＝＞垂直\n" +
                "２＝＞下上斜\n" +
                "３＝＞右向け半丸\n" +
                "４＝＞左向け半丸",

            [100] = "演奏ゲーム",
            [101] = "段位道場",
            [102] = "太鼓タワー",
            [103] = "メダル商店",
            [104] = "太鼓大冒険",
            [105] = "太鼓部屋",
            [106] = "設定",
            [107] = "ゲーム終了",

            [150] = "すきな曲や、むずかしさを\nえらんであそべるよ！",
            [151] = "３曲連続して演奏しながら、\nお願の合格を目指そう！\n合格すると腕前が認定されるよ！",
            [152] = "有限のライフを持って、\nタワーの頂上を登って\n挑戦できるよ！",
            [153] = "稼いだメダルを費やして、\n新しい曲やプチキャラを買えるよ！",
            [154] = "様々な障害に挑んで、\n新しい場所を発見出来るよ！",
            [155] = "キャラクタ、プチキャラ、\nネームプレートの情報を変えるよ！",
            [156] = "ゲームスタイルや\n一般的な設定を設けられるよ！",
            [157] = "セッションを終了できるよ。\nまた遊んでね！",

            [1000] = "到達階数",
            [1001] = "階",
            [1002] = "点",
            [1003] = "スコア",
        };
    }
}
